tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "planetscale/tap"
tap "stripe/stripe-cli"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern replacement for 'ls'
brew "exa"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# TIFF library and utilities
brew "libtiff"
# Open source relational database management system
brew "mysql-client"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Tool to interact with the Phrase API
brew "phrase-cli"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# CLI tool that moves files or folder to the trash
brew "trash"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Tracks most-used directories to make cd smarter
brew "z"
# The PlanetScale CLI
brew "planetscale/tap/pscale"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Sound and music editor
cask "ableton-live-suite10"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Free and open-source media player
cask "iina"
# Customize mouse behavior
cask "linearmouse"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Clipboard manager
cask "maccy"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Menu bar app that enables system-wide navigation using side mouse buttons
cask "sanesidebuttons"
# Block your own access to distracting websites
cask "selfcontrol"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# Tool to hide menu bar icons
cask "vanilla"
# Open-source code editor
cask "visual-studio-code"
vscode "abhishekpsr.vscode-swagger-diff"
vscode "angular.ng-template"
vscode "bmalehorn.vscode-fish"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docsmsft.docs-markdown"
vscode "docsmsft.docs-preview"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "jebbs.plantuml"
vscode "kimuson.ts-type-expand"
vscode "luke-zhang-04.processing-vscode"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "naumovs.color-highlight"
vscode "prisma.prisma"
vscode "reactreedev.reactree"
vscode "redhat.vscode-yaml"
vscode "sburg.vscode-javascript-booster"
vscode "statelyai.stately-vscode"
vscode "styled-components.vscode-styled-components"
vscode "thisotherthing.vscode-todo-list"
vscode "timonwong.shellcheck"
vscode "tobiah.language-pde"
vscode "vespa-dev-works.jestrunit"
vscode "viktorqvarfordt.vscode-pitch-black-theme"
vscode "wmaurer.change-case"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zengxingxin.sort-js-object-keys"
